wiki/archlinux/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>关于Archlinux的一些使用技巧 - Kelvin的胡言乱语</title>
    <meta charset="utf-8" />
    <meta name="author" content="Kelvin Hu" />
    <meta name="description" content="small skills/tips learned during using my archlinux" />
    <meta name="keywords" content="linux, archlinux" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Kelvin的胡言乱语</a></h1>
        <p>==============&gt; 重剑无锋，大巧不工。</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/kelvinh">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="kelvinh.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>关于Archlinux的一些使用技巧</h1>
<p>
这是一篇备忘性质的文章，主要记录我在使用Archlinux的过程中，遇到的一些问题及相应的解决办法，以及一些比较有用的命令或者tips。会不定期更新。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">sudo related</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
For other more <code>sudoers</code> configuration, please see this <a href="https://wiki.archlinux.org/index.php/Sudo">wiki page</a>.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">add a user to sudoers file:</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Users who do not exist in <code>/etc/sudoers</code> will not have permission to run command <code>sudo ...</code>, add the following line to this file:
</p>

<pre class="example">
&lt;username&gt; ALL=(ALL) ALL
</pre>

<p>
Now the user <i>&lt;username&gt;</i> will have the root privileges.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">make a user password needless:</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
Input password every time when you run <code>sudo ...</code> is really annoying, put the following line into <code>/etc/sudoers/</code>:
</p>

<pre class="example">
Defaults:&lt;username&gt; !authenticate
</pre>

<p>
Now the user <i>&lt;username&gt;</i> will not need to input password any more when running <code>sudo ...</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">wireless related</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">set up connection using netcfg, with WPA:</h3>
<div class="outline-text-3" id="text-orgheadline4">
<pre class="example">
touch /etc/network.d/home  # the file name can be whatever you like
vi /etc/network.d/home
</pre>

<p>
then input the following contents:
</p>

<pre class="example">
CONNECTION="wireless"
ESSID="&lt;my network&gt;"  # replace it with the real network ESSID
INTERFACE="wlan0"
SCAN="yes"
IP="dhcp"
TIMEOUT="10"
SECURITY="wpa"
KEY="&lt;passphrase&gt;"    # replace it with your real passphrase
</pre>

<p>
then save this file, run the following command:
</p>

<pre class="example">
netcfg home
</pre>

<p>
Now your network will be up.
</p>

<p>
Other useful commands:
</p>

<pre class="example">
ip link set wlan0 up/down # take up/down the wireless network
ip addr show wlan0        # show state of the wireless network
iwlist wlan0 scan         # scan available wireless points
iw dev wlan0 scan         # same as above
</pre>

<p>
Command <code>wifi-menu</code> is also very useful in package <i>netcfg</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">pacman related</h2>
<div class="outline-text-2" id="text-orgheadline8">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">query the package that a file belongs to:</h3>
<div class="outline-text-3" id="text-orgheadline6">
<pre class="example">
pacman -Qo /path/to/file
</pre>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">updating error:</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
When updating archlinux through pacman with <code>pacman -Syu</code>, below error occurs:
</p>

<blockquote>
<p>
error: dropbox: missing required signature
:: File /var/cache/pacman/pkg/dropbox-2.0.8-1-x86_64.pkg.tar.xz is corrupted (invalid or corrupted package (PGP signature)).
Do you want to delete it? [Y/n] y
error: failed to commit transaction (invalid or corrupted package)
Errors occurred, no packages were upgraded.
</p>
</blockquote>

<p>
Solution: modify <b>/etc/pacman.conf</b>, change the value of global <code>SigLevel</code> into <code>Optional TrustAll</code>.
</p>

<pre class="example">
#SigLevel = Required DatabaseOptional
SigLevel  = Optional TrustAll
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">usefull commands</h2>
<div class="outline-text-2" id="text-orgheadline11">
</div><div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">查看端口占用情况</h3>
<div class="outline-text-3" id="text-orgheadline9">
<pre class="example">
netstat -anput
</pre>

<p>
-a) established和listen都显示
</p>

<p>
-n) 显示数字，如127.0.0.1:80，而不是localhost:http
</p>

<p>
-p) 显示占用此端口的PID和程序名称
</p>

<p>
-u/-t) 显示TCP和UDP，查端口占用基本只有TCP/UDP是有用的，其它那些STREAM的根本不知道是神马类型。。
</p>

<p>
如果有装lsof的话，也可以用以下命令查看8080的端口占用：
</p>

<pre class="example">
lsof -i :8080
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">lookup binary dependency</h3>
<div class="outline-text-3" id="text-orgheadline10">
<pre class="example">
ldd [-v] &lt;path/to/binary&gt;
</pre>

<p>
or
</p>

<pre class="example">
readelf
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14">emacs related</h2>
<div class="outline-text-2" id="text-orgheadline14">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">emacs/fcitx快捷键冲突</h3>
<div class="outline-text-3" id="text-orgheadline12">
<p>
Emacs选择的默认快捷键是Ctrl + Space，和fcitx的激活快捷键Ctrl + Space冲突。
</p>

<p>
<b>解决方法</b> ：修改 <code>~/.config/fcitx/config</code> ：
</p>

<pre class="example">
TriggerKey=CTRL_RSHIFT    # default value is CTRL_SPACE
IMSwitchHotkey=ALT_SUPER  # default value is CTRL_SHIFT
</pre>

<p>
将TriggerKey由默认的Ctrl + Space改为Ctrl + Right Shift，但是由于另外一个选项也是Ctrl + Shift，有冲突，所以把冲突的IMSwitchHotkey给改掉。
</p>

<p>
然后，重启fcitx，这样fcitx和emacs的快捷键冲突就解决了。
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">emacs中文输入</h3>
<div class="outline-text-3" id="text-orgheadline13">
<p>
要在emacs中输入中文，还需要设置LC_CTYPE为zh_CN.UTF-8，不然依旧无法输入。比较好的解决方法：
</p>

<pre class="example">
sudo mv /usr/bin/emacs /usr/bin/emacs.origin
sudo touch /usr/bin/emacs
sudo chmod 755 /usr/bin/emacs
</pre>

<p>
然后，在 <code>/usr/bin/emacs</code> 中输入以下内容：
</p>

<pre class="example">
#!/bin/zsh
LC_CTYPE=zh_CN.UTF-8
/usr/bin/emacs.origin "$@"
</pre>

<p>
再运行emacs就可以输入中文。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17">mplayer related</h2>
<div class="outline-text-2" id="text-orgheadline17">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">改变音轨</h3>
<div class="outline-text-3" id="text-orgheadline15">
<p>
有些电影本身就是双语的，这时候只需要切换一下音轨就可以了：
</p>

<pre class="example">
mplayer ... -aid 0/1 (for more than one language)
</pre>

<p>
至于音轨的信息在mplayer播放的时候，会在命令行输出，所以只需要先试着播放一下，然后看命令行的音轨信息，再按照上面加上参数就可以了。
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">字幕乱码</h3>
<div class="outline-text-3" id="text-orgheadline16">
<p>
不太清楚mplayer默认使用的是什么编码，但肯定有些字幕采用的编码和mplayer默认使用的编码不同，这就导致播放的时候会乱码，但因为大家都是天朝人，所以还是可以大致猜到字幕的编码的，一般情况加上下面的参数就OK了：
</p>

<pre class="example">
mplayer ... -subcp cp936
</pre>

<p>
如果加上这个参数后，还是显示有乱码，那就再试试其它编码，gb2312神马的，总有一个是可以的。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18">终端某些文字显示为白色小方块</h2>
<div class="outline-text-2" id="text-orgheadline18">
<p>
因为locale选了其它语言，但又没安装其它语言的字体，所以显示小方块。
</p>

<p>
<b>解决方法</b> ：编辑 <code>/etc/locale.gen</code> ，只保留 <i>en_US.UTF-8 UTF-8</i> 这一行，再运行 <code>locale-gen</code> ，重启既可。
</p>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19">NTFS partitions</h2>
<div class="outline-text-2" id="text-orgheadline19">
<p>
when writing files to NTFS partitions, it will raise an error:
</p>

<pre class="example">
cannot create regular file 'filename': Permission denied
</pre>

<p>
it even happened when I am the root.
</p>

<p>
after googling, it is because the partition type is improper during mounting, try use the following command will fix the error:
</p>

<pre class="example">
sudo mount -t ntfs-3g /dev/sdb1 /mnt
</pre>

<p>
here <code>/dev/sdb1</code> is the NTFS partition, if <b>ntfs-3g</b> is not installed, use the following command to install it:
</p>

<pre class="example">
sudo pacman -S ntfs-3g
</pre>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2012-08-29</span>
        <span title="last modification date" class="post-info">2013-05-28</span>
        <span title="tags" class="post-info"><a href="/tags/linux/">Linux</a>, <a href="/tags/archlinux/">Archlinux</a></span>
        <span title="author" class="post-info">Kelvin Hu</span>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="/media/js/main.js"></script>
      <script type="text/javascript">
        var _gaq = _gaq || [];
        _gaq.push(['_setAccount', 'UA-41088132-1']);
        _gaq.push(['_trackPageview']);
        (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
        })();
      </script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.x (<a href="http://orgmode.org">Org mode</a> 8.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:ini &lt;dot&gt; kelvin &lt;at&gt; gmail &lt;dot&gt; com">Kelvin Hu</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
